{
  "greeting": {
    "welcome": "नमस्ते! मैं आपकी मदद के लिए हूं। आज आपको क्या चाहिए?",
    "welcome_sir": "नमस्ते! मैं आपकी मदद के लिए हूं, सर। आज आपको क्या चाहिए?",
    "welcome_madam": "नमस्ते! मैं आपकी मदद के लिए हूं, मैडम। आज आपको क्या चाहिए?",
    "returning": "फिर से स्वागत है! आज मैं आपकी कैसे मदद कर सकता हूं?",
    "language_set": "अब से, मैं आपसे हिंदी में बात करूंगा।"
  },
  "language_detection": {
    "menu": "अंग्रेज़ी के लिए 1, मंदारिन के लिए 2, हिंदी के लिए 3, तमिल के लिए 4 दबाएं।",
    "confirm": "क्या मैंने सही समझा? आप हिंदी चाहते हैं?",
    "saved": "मैंने आपकी भाषा प्राथमिकता सहेज ली है।"
  },
  "common": {
    "repeat": "किसी भी समय 0 दबाएं या 'दोहराएं' कहें मुझे फिर से सुनने के लिए।",
    "slow_down": "मुझे धीरे से बताएं — मैं सुन रहा हूं।",
    "confirmation": "क्या मैंने सही सुना: {message}?",
    "understood": "मैं समझ गया। मुझे आपकी मदद करने दें।",
    "one_moment": "एक पल, कृपया।",
    "dont_worry": "चिंता मत करो, मैं आपके साथ कदम दर कदम करूंगा।",
    "yes": "हां",
    "no": "नहीं",
    "help": "किसी भी समय 'मदद' कहें अगर आपको सहायता चाहिए।",
    "main_menu": "मुख्य मेनू पर वापस जा रहे हैं। और क्या मैं आपकी मदद कर सकता हूं?"
  },
  "tasks": {
    "zoom_join": {
      "name": "Zoom मीटिंग में शामिल हों",
      "start": "मैं आपको Zoom मीटिंग में शामिल होने में मदद करूंगा। क्या आपके पास मीटिंग लिंक या ID है?",
      "get_id": "कृपया मुझे अपनी Zoom मीटिंग ID या लिंक बताएं। आप एक बार में एक नंबर बोल सकते हैं।",
      "confirm_id": "मैंने {meetingId} सुना। क्या यह सही है?",
      "opening_app": "अब मैं आपको Zoom ऐप खोलने में मदद करूंगा।",
      "entering_id": "मैंने ID सुन ली। अब इसे आपके लिए दर्ज कर रहा हूं।",
      "joining": "अब मीटिंग में शामिल हो रहे हैं। कृपया प्रतीक्षा करें।",
      "success": "आप अब मीटिंग में हैं! क्या आप अन्य लोगों को देख रहे हैं?",
      "need_audio": "क्या आप चाहते हैं कि मैं आपका माइक्रोफोन चालू करने में मदद करूं?",
      "need_video": "क्या आप चाहते हैं कि मैं आपका कैमरा चालू करने में मदद करूं?",
      "complete": "बहुत बढ़िया! आप तैयार हैं। अपनी मीटिंग का आनंद लें!"
    },
    "phone_call": {
      "name": "फोन कॉल करें",
      "start": "मैं आपको फोन कॉल करने में मदद करूंगा। आप किसे कॉल करना चाहेंगे?",
      "get_number": "कृपया मुझे फोन नंबर बताएं, या अपने संपर्कों से व्यक्ति का नाम बोलें।",
      "confirm_number": "मैं {number} पर कॉल करूंगा। क्या यह सही है?",
      "calling": "अब कॉल कर रहे हैं। कृपया प्रतीक्षा करें।",
      "connected": "आप अब जुड़ गए हैं। जब तैयार हों तो बोलें।",
      "failed": "मैं कॉल कनेक्ट नहीं कर सका। क्या आप फिर से कोशिश करना चाहेंगे?"
    },
    "volume_adjust": {
      "name": "वॉल्यूम समायोजित करें",
      "start": "मैं आपको वॉल्यूम समायोजित करने में मदद करूंगा। 'तेज़', 'धीमा', या 1 से 10 तक का नंबर बोलें।",
      "current": "आपका वर्तमान वॉल्यूम {level} है।",
      "adjusting": "अब वॉल्यूम समायोजित कर रहे हैं।",
      "confirm": "क्या यह बेहतर है?",
      "complete": "वॉल्यूम अब {level} पर सेट है।"
    },
    "wifi_connect": {
      "name": "Wi-Fi से कनेक्ट करें",
      "start": "मैं आपको Wi-Fi से कनेक्ट करने में मदद करूंगा। क्या आप अपनी स्क्रीन पर नेटवर्क का नाम देख सकते हैं?",
      "get_network": "कृपया मुझे उस नेटवर्क का नाम बताएं जिससे आप कनेक्ट करना चाहते हैं।",
      "get_password": "अब, कृपया मुझे Wi-Fi पासवर्ड धीरे से बताएं।",
      "connecting": "{network} से कनेक्ट हो रहे हैं। इसमें कुछ समय लग सकता है।",
      "success": "आप अब {network} से कनेक्ट हैं!",
      "failed": "मैं कनेक्ट नहीं कर सका। मुझे फिर से कोशिश करने दें, या आप एक अलग नेटवर्क आजमा सकते हैं।"
    },
    "scam_check": {
      "name": "घोटाले की जांच करें",
      "start": "मैं जांच करूंगा कि यह नंबर सुरक्षित है या नहीं। कृपया मुझे फोन नंबर बताएं।",
      "checking": "अब नंबर की जांच कर रहे हैं। एक पल।",
      "safe": "यह नंबर सुरक्षित प्रतीत होता है। इसमें {reports} सकारात्मक रिपोर्ट हैं।",
      "warning": "सावधान रहें! इस नंबर में {reports} घोटाला रिपोर्ट हैं। मैं उत्तर नहीं देने की सलाह देता हूं।",
      "blocked": "मैंने आपकी सुरक्षा के लिए इस नंबर को ब्लॉक कर दिया है।",
      "no_data": "मेरे पास इस नंबर की कोई जानकारी नहीं है। कृपया सतर्क रहें।"
    },
    "sync_me_install": {
      "name": "घोटाला शील्ड सेटअप",
      "intro": "आपकी सुरक्षा के लिए, मैं अब घोटाला शील्ड चालू करूंगा। यह Sync.me का उपयोग करता है — दुनिया भर में 1 करोड़ से अधिक बुजुर्गों द्वारा विश्वसनीय और Google Play स्टोर पर शीर्ष 100 सुरक्षा उपकरणों में सूचीबद्ध। यह आपको चेतावनी देता है अगर कॉल करने वाला भरोसेमंद नहीं है। मैं इसे आपके लिए सेट कर दूंगा। क्या यह ठीक है?",
      "installing": "अब घोटाला शील्ड सेट कर रहे हैं। इसमें केवल एक पल लगेगा।",
      "success": "घोटाला शील्ड अब सक्रिय है। जाली कॉलर आपके उत्तर देने से पहले 'संभावित घोटाला' दिखाएंगे। आप सुरक्षित हैं।",
      "already_active": "अच्छी खबर! घोटाला शील्ड पहले से ही आपकी रक्षा कर रहा है।",
      "failed": "मुझे इसे सेट करने में परेशानी हुई। क्या आप फिर से कोशिश करना चाहेंगे?"
    },
    "contact_family": {
      "name": "परिवार से संपर्क करें",
      "start": "मैं आपको आपके परिवार से जोड़ूंगा। आप किससे संपर्क करना चाहेंगे?",
      "list": "मैं आपको इनसे जोड़ सकता हूं: {contacts}",
      "confirm": "मैं {name} को {number} पर कॉल करूंगा। क्या यह सही है?",
      "calling": "अब {name} को कॉल कर रहे हैं।",
      "no_contacts": "मेरे पास कोई पारिवारिक संपर्क सहेजा नहीं है। क्या आप एक जोड़ना चाहेंगे?"
    },
    "general_qa": {
      "listening": "मैं सुन रहा हूं। कृपया मुझसे कुछ भी पूछें।",
      "thinking": "मुझे इसके बारे में सोचने दें।",
      "answer": "{answer}",
      "follow_up": "क्या आप इसके बाद कुछ करना चाहते हैं?",
      "anything_else": "क्या कुछ और है जिसमें मैं आपकी मदद कर सकता हूं?"
    }
  },
  "scam_shield": {
    "call_warning": "चेतावनी! इस कॉलर को संभावित घोटाले के रूप में रिपोर्ट किया गया है। क्या आप इस नंबर को ब्लॉक करना चाहते हैं?",
    "blocked": "मैंने इस नंबर को ब्लॉक कर दिया है। आप सुरक्षित हैं।",
    "status_active": "आपका घोटाला शील्ड सक्रिय है और आपकी रक्षा कर रहा है।",
    "status_inactive": "आपका घोटाला शील्ड सक्रिय नहीं है। क्या आप चाहेंगे कि मैं इसे चालू करूं?"
  },
  "errors": {
    "not_understand": "क्षमा करें, मुझे वह समझ नहीं आया। क्या आप कृपया दोहरा सकते हैं?",
    "technical": "मुझे तकनीकी कठिनाइयां हो रही हैं। मुझे फिर से कोशिश करने दें।",
    "timeout": "मैंने कुछ नहीं सुना। क्या आप अभी भी हैं?",
    "try_again": "चलिए फिर से कोशिश करते हैं। {message}"
  },
  "goodbye": {
    "end_call": "कॉल करने के लिए धन्यवाद। ख्याल रखना!",
    "end_session": "अलविदा! जब भी आपको ज़रूरत हो मैं यहां हूं।",
    "come_back": "जब भी मदद चाहिए मुझे कॉल करें। अलविदा!"
  }
}

